app/services/sleep_tracker.rb

  def check_in
    return if user.is_sleeping?

    user.sleeping_records.create!(check_in_time: DateTime.now, date: Date.today)
---
INSERT INTO "sleeping_records" ("user_id", "check_in_time", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["check_in_time", "2019-06-22 12:26:35.152692"], ["date", "2019-06-22"], ["created_at", "2019-06-22 12:26:35.159995"], ["updated_at", "2019-06-22 12:26:35.159995"]]

  def check_out
    return if user.is_awake?

    record = user.sleeping_records.last
    record.update!(check_out_time: DateTime.now) if record
---
UPDATE "sleeping_records" SET "check_out_time" = $1, "updated_at" = $2 WHERE "sleeping_records"."id" = $3  [["check_out_time", "2019-06-22 12:30:56.466786"], ["updated_at", "2019-06-22 12:30:56.469922"], ["id", 6]]