app/api/api/v1/resources/users.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          route_param :id do
            desc 'Get specific user profile'
            get do
              user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            resource :check_in do
              desc 'Will go to bed'
              post do
                user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            resource :check_out do
              desc 'Woke up from bed'
              post do
                user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
                         desc: 'The id of the user being followed'
              end
              post do
                user = User.find(params[:id])
                following_user = User.find(params[:followed_user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
                         desc: 'The id of the user being unfollowed'
              end
              post do
                user = User.find(params[:id])
                following_user = User.find(params[:followed_user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              desc 'List all his friends and their weekly sleeping records'

              get do
                user = User.find(params[:id])